In [1]:
import pandas as pd

In [4]:
# DataFrames are conceptually 2d Series, with an index and multiple
# columns, each having its own label
record1 = pd.Series({'Name': 'Julia',
'Class': 'Physics',
'Score': 85})

record2 = pd.Series({'Name': 'Sara',
'Class': 'Chemistry',
'Score': 82})

record3 = pd.Series({'Name': 'Rebecca',
'Class': 'Biology',
'Score': 90})

# Just as with Series, we can pass the individual items in an array, 
# and then pass the index as a second arguments
df = pd.DataFrame([record1, record2, record3], index = ['school1', 'school2', 'school3'])
df

            Name      Class  Score
school1    Julia    Physics     85
school2     Sara  Chemistry     82
school3  Rebecca    Biology     90

In [8]:
# An alternative method is to use a list  of dictionaries, each dict
# representing a different row
students = [{'Name': 'Julia', 'Class': 'Physics', 'Score': 85},
            {'Name': 'Sara', 'Class': 'Chemistry', 'Score': 82},
            {'Name': 'Rebecca', 'Class': 'Biology', 'Score': 90}]

df = pd.DataFrame(students, index = ['school1', 'school2', 'school1'])
df

            Name      Class  Score
school1    Julia    Physics     85
school2     Sara  Chemistry     82
school1  Rebecca    Biology     90

In [7]:
# Just as with Series we can use .iloc and .loc, but bc DataFrames are 
# 2d if we only give it one index it'll return the whole row/Series
df.loc['school2']

Name          Sara
Class    Chemistry
Score           82
Name: school2, dtype: object

In [9]:
# If there are non-unique index/columns, it'll return a dataframe 
df.loc['school1']

            Name    Class  Score
school1    Julia  Physics     85
school1  Rebecca  Biology     90

In [12]:
# If we wanted to query only student names, we can use two parameters
df.loc['school1', 'Name']

school1      Julia
school1    Rebecca
Name: Name, dtype: object

In [13]:
# To select a column we can transpose the matrix, making rows into
# columns and columns into rows
df.T

       school1    school2  school1
Name     Julia       Sara  Rebecca
Class  Physics  Chemistry  Biology
Score       85         82       90

In [16]:
df.T.loc['Name']

school1      Julia
school2       Sara
school1    Rebecca
Name: Name, dtype: object

In [17]:
# Howeverm since .loc and .iloc are used for row selection, Pandas 
# reserves the indexing operator [] for columns. Using .loc produces
# an error bc of this
df['Name']

school1      Julia
school2       Sara
school1    Rebecca
Name: Name, dtype: object

In [18]:
# You can also chain operations together
df.loc['school1']['Name']

school1      Julia
school1    Rebecca
Name: Name, dtype: object

In [24]:
# Chaining can be costly however, since Pandas creates a copy of
# the dataframe instead of a view on the dataframe

# An alternative is to use .loc with slicing
df.loc[:, ['Name','Score']]

            Name  Score
school1    Julia     85
school2     Sara     82
school1  Rebecca     90

In [26]:
# To delete data, both from Series and DataFrames, we can use
# the drop() function, which takes a single parameter: the 
# index/row label
# This function doesn't actually change the of dataframe but
# return a copy of it minus the dropped items
df.drop('school1')

         Name      Class  Score
school2  Sara  Chemistry     82

In [27]:
df

            Name      Class  Score
school1    Julia    Physics     85
school2     Sara  Chemistry     82
school1  Rebecca    Biology     90

In [28]:
# To change it just change the optional inplace parameter 
# to True
# By default drop() delets row but you can drop columns by 
# setting the optional axis parameter to 1

# Make a copy
copy_df = df.copy()

# Drop the name column from this copy
copy_df.drop('Name', inplace = True, axis = 1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [29]:
# A similar method that edits the og dataframe by default
# is using the indexing operator with the del keyword
del copy_df['Class']
copy_df

         Score
school1     85
school2     82
school1     90

In [37]:
# Adding a new column to the dataframe is as easy as
# assigning it to some value with the indexing operator
df['Class_Ranking'] = None
df

            Name      Class  Score Class_Ranking
school1    Julia    Physics     85          None
school2     Sara  Chemistry     82          None
school1  Rebecca    Biology     90          None